Files/Libros/HeadFirstC/HeadFirstC.org
#+TITLE: Head First C

* Getting started with C
** but what does a complete C program look like?
- Para crear un programa necesitas escribir tu código en un archivo
  - Normalmente terminan con la extensión =.c=.
- Normalmente empiezan con un comentario.
  - Este describe el propósito del código o programa
- Luego viene la sección de =imports=
  - C es un lenguaje muy pequeño y casi no puede hacer nada sin el uso de librerías externas
  - Necesitas decirle al compilador que código externo usar con el uso de =header files=
  - Un header común es =stdio.h= este contiene código que permite leer y escribir datos de
    la terminal
- Lo ultimo que verás en un archivo de c serán las funciones
  - Todo el código en C corre dentro de funciones.
  - La función más importante es llamada =main()=.
    - Esta es el punto de inicio de todo el código en tu programa

#+begin_src c
/*
 ,* Program to calculate the number of cards in the shoe.
 ,* This code is released under the Vegas Public License.
 ,* (c)2014, The College Blackjack Team.
 ,*/

#include <stdio.h>

int main () {
    int decks;
    puts("Enter a number of decks");
    scanf("%i", &decks);
    if (decks < 1) {
        puts("That is not a valid number of decks");
        return 1
    }
    printf("There are %i cards\n", (decks * 52));
    return 0
}
#+end_src

*** La función =main=
- La computadora empezará a correr el programa desde la función main
  - El nombre es importante, debe de llamarse =main()=.
- Esta tiene un tipo de retorno =return type= de entero (=int=).
  - Esto es porque la computadora necesita tener un método de saber si tu programa ejecuto sin errores.
    - La computadora sabe esto verificando el valor de retorno de la función =main=.
  - Si el programa retorna 0, significa que el programa se ejecuto sin errores.
  - Si le dices que retorne algún otro número, significa que hubo un problema.
- El nombre de la función se escribe después del tipo de retorno.
  - Si la función =main= necesitará algún parametro estos irían entre los parentesis =()=.
  - Después viene el cuerpo de la función, el cual debe estar entre llaves ={}=.

*** La función =printf=
- Es usada para mostrar texto formateado en la terminal.
- Reemplaza caracteres de formato con los valores de las variables.


#+begin_src c
printf("%s says the count is %s", "ben", 21);
#+end_src

- =%s= será insertado como un =string=.
- =%i= será insertado como un =int=.
- Y estos van en orden junto con los otros parametros
  - ="ben"= siendo un =string=.
  - =21= siendo un =int=.

