Publ/Libros/HeadFirstC/HeadFirstC.html
<!doctype html>
<html lang="en">
<head>
<title>Head First C</title>
<!-- 2022-02-25 Fri 01:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Getting started with C</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. but what does a complete C program look like?</a></li>
<li><a href="#sec-1-2">1.2. But How do you run the program?</a></li>
<li><a href="#sec-1-3">1.3. Dos tipos de comandos</a></li>
<li><a href="#sec-1-4">1.4. There&rsquo;s more to booleans than equals</a></li>
<li><a href="#sec-1-5">1.5. Pulling the ol&rsquo; switcheroo</a></li>
<li><a href="#sec-1-6">1.6. Sometimes once is not enough</a></li>
<li><a href="#sec-1-7">1.7. Los ciclos a veces siguen la misma estructura</a></li>
<li><a href="#sec-1-8">1.8. Usas un <code>break</code> para salir</a></li>
<li><a href="#sec-1-9">1.9. Escribiendo funciones</a></li>
</ul>
</li>
<li><a href="#sec-2">2. What are you pointing at?</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. El código en C incluye Punteros</a></li>
<li><a href="#sec-2-2">2.2. Escarbando en la memoria.</a></li>
<li><a href="#sec-2-3">2.3. Usando punteros de memoria</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Head First C</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting started with C</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> but what does a complete C program look like?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Para crear un programa necesitas escribir tu código en un archivo
<ul class="org-ul">
<li>Normalmente terminan con la extensión <code>.c</code>.
</li>
</ul>
</li>
<li>Normalmente empiezan con un comentario.
<ul class="org-ul">
<li>Este describe el propósito del código o programa
</li>
</ul>
</li>
<li>Luego viene la sección de <code>imports</code>
<ul class="org-ul">
<li>C es un lenguaje muy pequeño y casi no puede hacer nada sin el uso de librerías externas
</li>
<li>Necesitas decirle al compilador que código externo usar con el uso de <code>header files</code>
</li>
<li>Un header común es <code>stdio.h</code> este contiene código que permite leer y escribir datos de
la terminal
</li>
</ul>
</li>
<li>Lo ultimo que verás en un archivo de c serán las funciones
<ul class="org-ul">
<li>Todo el código en C corre dentro de funciones.
</li>
<li>La función más importante es llamada <code>main()</code>.
<ul class="org-ul">
<li>Esta es el punto de inicio de todo el código en tu programa
</li>
</ul>
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #6272a4; font-style: italic;">/*</span>
<span style="color: #6272a4; font-style: italic;"> * Program to calculate the number of cards in the shoe.</span>
<span style="color: #6272a4; font-style: italic;"> * This code is released under the Vegas Public License.</span>
<span style="color: #6272a4; font-style: italic;"> * (c)2014, The College Blackjack Team.</span>
<span style="color: #6272a4; font-style: italic;"> */</span>

<span style="color: #bd93f9; font-weight: bold;">#include</span> <span style="color: #f1fa8c;">&lt;stdio.h&gt;</span>

<span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">main</span> <span style="color: #61bfff; background-color: #282a36;">()</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">decks</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">puts</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"Enter a number of decks"</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">scanf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%i"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #ff79c6; font-style: italic;">&amp;</span>decks<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>decks <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">1</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #bd93f9; font-weight: bold;">puts</span><span style="color: #50fa7b; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"That is not a valid number of decks"</span><span style="color: #50fa7b; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
        <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #8be9fd;">1</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span>
    <span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"There are %i cards\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #50fa7b; background-color: #282a36;">(</span>decks <span style="color: #ff79c6; font-style: italic;">*</span> <span style="color: #8be9fd;">52</span><span style="color: #50fa7b; background-color: #282a36;">)</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #8be9fd;">0</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> La función <code>main</code></h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>La computadora empezará a correr el programa desde la función main
<ul class="org-ul">
<li>El nombre es importante, debe de llamarse <code>main()</code>.
</li>
</ul>
</li>
<li>Esta tiene un tipo de retorno <code>return type</code> de entero (<code>int</code>).
<ul class="org-ul">
<li>Esto es porque la computadora necesita tener un método de saber si tu programa ejecuto sin errores.
<ul class="org-ul">
<li>La computadora sabe esto verificando el valor de retorno de la función <code>main</code>.
</li>
</ul>
</li>
<li>Si el programa retorna 0, significa que el programa se ejecuto sin errores.
</li>
<li>Si le dices que retorne algún otro número, significa que hubo un problema.
</li>
</ul>
</li>
<li>El nombre de la función se escribe después del tipo de retorno.
<ul class="org-ul">
<li>Si la función <code>main</code> necesitará algún parametro estos irían entre los parentesis <code>()</code>.
</li>
<li>Después viene el cuerpo de la función, el cual debe estar entre llaves <code>{}</code>.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> La función <code>printf</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Es usada para mostrar texto formateado en la terminal.
</li>
<li>Reemplaza caracteres de formato con los valores de las variables.
</li>
</ul>


<div class="org-src-container">

<pre class="src src-c"><span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%s says the count is %s"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #f1fa8c;">"ben"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #8be9fd;">21</span><span style="color: #61bfff; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<ul class="org-ul">
<li><code>%s</code> será insertado como un <code>string</code>.
</li>
<li><code>%i</code> será insertado como un <code>int</code>.
</li>
<li>Y estos van en orden junto con los otros parametros
<ul class="org-ul">
<li><code>"ben"</code> siendo un <code>string</code>.
</li>
<li><code>21</code> siendo un <code>int</code>.
</li>
</ul>
</li>
</ul>
</div>
</div>
