Files/Libros/HeadFirstC/HeadFirstC.org
*** Ejemplo
#+begin_src c
// Program to evaluate face values.

#include <stdio.h>
#include <stdlib.h>

int main() {
    char card_name[3];
    puts("Enter the card_name: ");
    scanf("%2s", card_name); // leemos 2 caracteres
    int val = 0;
    if (card_name[0] == 'K') { // Obtenemos el primer caracter de card_name
        val = 10;
    } else if (card_name[0] == 'Q') {
        val = 10;
    } else if (card_name[0] == 'J') {
        val = 10;
    } else if (card_name[0] == 'A') {
        val = 11;
    } else {
        val = atoi(card_name);
    }


    printf("The card value is: %i\n" val);
    return 0;
}
#+end_src

** But How do you run the program?
- C es un lenguaje compilado
  - Esto significa que necesitas convertir (compilar) el código a código maquina.
  - Para hacer esto necesitas un programa llamado compilador.
  - Uno de los más populares es gcc.


Suponiendo que se guardo el programa anterior con el nombre =cards.c=:
- Necesitamos escribir:
  - =gcc cards.c -o cards=
    - Esto dice: compila el archivo =cards.c= en un ejecutable llamado =cards=.
  - ahora podemos correr el programa escribiendo =./cards=.
- Podemos compilar y correr nuestro código en un solo comando haciendo:
  - =gcc cards.c -o cards && ./cards=
    - el =&&= básicamente dice "si se completa con éxito, haz esto otro".
    - En un sistema windows podrías necesitar escribir =cards= solamente en lugar de =./cards=.

*** Teoría de =Strings=
C no tiene soporte para =strings= por defecto (esto porque es de más bajo nivel que otros lenguajes),
así que tenemos que usar un arreglo de caracteres para simular un =string=.

- Los =strings= son en esencia un arreglo de caracteres individuales.
- De esta manera podemos referirnos a los caracteres de un =string= con su índice.

C al ser de más bajo nivel que otros lenguajes no siempre puede saber el que tan largo un arreglo es.

Si C va a escribir algo en la pantalla, necesita saber en donde termina este =string=, y lo hace usando
un *carácter centinela*.

Este carácter es un carácter al final del =string= que tiene el valor =\0=.
Entonces cuando escribe carácter por carácter se va a detener cuando encuentre este centinela.

#+begin_quote
Se suele referir a este como  el caracter =null=.
#+end_quote

Si tenemos =s = "shatner"= C lo guarda en la memoria como =shatner\0=

Esta es la razón por la que en nuestro código usamos =char card_name[3];=.
Vamos a leer 2 caracteres, pero ponemos que nuestro arreglo es de 3 porque hacemos espacio para el centinela.

**** =string literals= y arreglos

- Los arreglos son numerados desde el 0 y no desde el 1 porque:
  - El índice en C es un =offset= una compensación.
    - La computadora va a guardar caracteres en bytes consecutivos de memoria.
    - La computadora puede usar este índice para calcular la posición de un carácter en la memoria.
      - Si =c[0]= esta en la posición de memoria =1000000=, C puede calcular que =c[96]= esta en =1000000 + 96=.
- Debemos usar comillas simples =''= para los caracteres individuales y las comillas dobles =""= para los =strings literals=.
  - Podemos usar estos como =strings= normales, pero estos son inmutables.
    - Entonces no podemos cambiar el contenido de estos una vez son creados.
      - Si lo hacemos obtendremos un error al compilar.

