Publ/Libros/HeadFirstC/HeadFirstC.html

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Ejemplo</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #6272a4; font-style: italic;">// Program to evaluate face values.</span>

<span style="color: #bd93f9; font-weight: bold;">#include</span> <span style="color: #f1fa8c;">&lt;stdio.h&gt;</span>
<span style="color: #bd93f9; font-weight: bold;">#include</span> <span style="color: #f1fa8c;">&lt;stdlib.h&gt;</span>

<span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff; background-color: #282a36;">()</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #ffb86c;">char</span> <span style="color: #ffc9e8;">card_name</span><span style="color: #ff79c6; background-color: #282a36;">[</span><span style="color: #8be9fd;">3</span><span style="color: #ff79c6; background-color: #282a36;">]</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">puts</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"Enter the card_name: "</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">scanf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%2s"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> card_name<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// leemos 2 caracteres</span>
    <span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">0</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>card_name<span style="color: #50fa7b; background-color: #282a36;">[</span><span style="color: #8be9fd;">0</span><span style="color: #50fa7b; background-color: #282a36;">]</span> <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">'K'</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span> <span style="color: #6272a4; font-style: italic;">// Obtenemos el primer caracter de card_name</span>
        <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">10</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>card_name<span style="color: #50fa7b; background-color: #282a36;">[</span><span style="color: #8be9fd;">0</span><span style="color: #50fa7b; background-color: #282a36;">]</span> <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">'Q'</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">10</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>card_name<span style="color: #50fa7b; background-color: #282a36;">[</span><span style="color: #8be9fd;">0</span><span style="color: #50fa7b; background-color: #282a36;">]</span> <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">'J'</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">10</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>card_name<span style="color: #50fa7b; background-color: #282a36;">[</span><span style="color: #8be9fd;">0</span><span style="color: #50fa7b; background-color: #282a36;">]</span> <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">'A'</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">11</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #ffc9e8;">val</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #bd93f9; font-weight: bold;">atoi</span><span style="color: #50fa7b; background-color: #282a36;">(</span>card_name<span style="color: #50fa7b; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span>


    <span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"The card value is: %i\n"</span> val<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #8be9fd;">0</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> But How do you run the program?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>C es un lenguaje compilado
<ul class="org-ul">
<li>Esto significa que necesitas convertir (compilar) el código a código maquina.
</li>
<li>Para hacer esto necesitas un programa llamado compilador.
</li>
<li>Uno de los más populares es gcc.
</li>
</ul>
</li>
</ul>


<p>
Suponiendo que se guardo el programa anterior con el nombre <code>cards.c</code>:
</p>
<ul class="org-ul">
<li>Necesitamos escribir:
<ul class="org-ul">
<li><code>gcc cards.c -o cards</code>
<ul class="org-ul">
<li>Esto dice: compila el archivo <code>cards.c</code> en un ejecutable llamado <code>cards</code>.
</li>
</ul>
</li>
<li>ahora podemos correr el programa escribiendo <code>./cards</code>.
</li>
</ul>
</li>
<li>Podemos compilar y correr nuestro código en un solo comando haciendo:
<ul class="org-ul">
<li><code>gcc cards.c -o cards &amp;&amp; ./cards</code>
<ul class="org-ul">
<li>el <code>&amp;&amp;</code> básicamente dice &ldquo;si se completa con éxito, haz esto otro&rdquo;.
</li>
<li>En un sistema windows podrías necesitar escribir <code>cards</code> solamente en lugar de <code>./cards</code>.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Teoría de <code>Strings</code></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
C no tiene soporte para <code>strings</code> por defecto (esto porque es de más bajo nivel que otros lenguajes),
así que tenemos que usar un arreglo de caracteres para simular un <code>string</code>.
</p>

<ul class="org-ul">
<li>Los <code>strings</code> son en esencia un arreglo de caracteres individuales.
</li>
<li>De esta manera podemos referirnos a los caracteres de un <code>string</code> con su índice.
</li>
</ul>

<p>
C al ser de más bajo nivel que otros lenguajes no siempre puede saber el que tan largo un arreglo es.
</p>

<p>
Si C va a escribir algo en la pantalla, necesita saber en donde termina este <code>string</code>, y lo hace usando
un <b>carácter centinela</b>.
</p>

<p>
Este carácter es un carácter al final del <code>string</code> que tiene el valor <code>\0</code>.
Entonces cuando escribe carácter por carácter se va a detener cuando encuentre este centinela.
</p>

<blockquote>
<p>
Se suele referir a este como  el caracter <code>null</code>.
</p>
</blockquote>

<p>
Si tenemos <code>s = "shatner"</code> C lo guarda en la memoria como <code>shatner\0</code>
</p>

<p>
Esta es la razón por la que en nuestro código usamos <code>char card_name[3];</code>.
Vamos a leer 2 caracteres, pero ponemos que nuestro arreglo es de 3 porque hacemos espacio para el centinela.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a><code>string literals</code> y arreglos<br ><div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>Los arreglos son numerados desde el 0 y no desde el 1 porque:
<ul class="org-ul">
<li>El índice en C es un <code>offset</code> una compensación.
<ul class="org-ul">
<li>La computadora va a guardar caracteres en bytes consecutivos de memoria.
</li>
<li>La computadora puede usar este índice para calcular la posición de un carácter en la memoria.
<ul class="org-ul">
<li>Si <code>c[0]</code> esta en la posición de memoria <code>1000000</code>, C puede calcular que <code>c[96]</code> esta en <code>1000000 + 96</code>.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>Debemos usar comillas simples <code>''</code> para los caracteres individuales y las comillas dobles <code>""</code> para los <code>strings literals</code>.
<ul class="org-ul">
<li>Podemos usar estos como <code>strings</code> normales, pero estos son inmutables.
<ul class="org-ul">
<li>Entonces no podemos cambiar el contenido de estos una vez son creados.
<ul class="org-ul">
<li>Si lo hacemos obtendremos un error al compilar.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li></ol>
</div>
