Files/Libros/HeadFirstC/HeadFirstC.org
*** Painless Operations
En C, el símbolo de igual (=) es usado para asignaciones. pero un doble igual es usado para verificar igualdad.
Pero tambien lo podemos usar para hacer operaciones

#+begin_src c
teeth = 4; // asignación
teeth == 4; // igualdad
teeth += 2; // Sumar dos a teeth
teeth -+ 2; // Sestar dos a teeth
theeth ++; // Incrementar teeth 1
theeth --; // Decrementar teeth 1
#+end_src

** Dos tipos de comandos
Hasta ahora cada comando que se ha visto cae en una de dos categorías:

*** Haz algo
La mayoría de los comandos en C son expresiones. Estos *hacen* cosas y nos *dicen* cosas.

#+begin_src c
split_hand(); // <- expresión simple
#+end_src

A veces agrupamos expresiones juntas para crear un *bloque* y estos están entre llaves.

#+begin_src c
{
    deal_first_card();
    deal_second_card();
    cards_in_hand = 2;
}
#+end_src

*** Haz algo *solo si* algo más es verdadero
Expresiones de control como el =if= verifican una condición antes de correr el código.

#+begin_src c
if (value_of_hand <= 16) // Condición
    hit(); // Esta expresión correrá si la condición es verdadera.
else
    stand(); // Corre esta expresión si la condición es falsa.
#+end_src

Si una expresión =if= necesita hacer más de una cosa, podemos agregar las llaves para hacer un bloque

#+begin_src c
if (dealer_card == 5) {
    double_down();
    hit();
}
#+end_src

** There's more to booleans than equals
Hay ocasiones en las cuales queremos ver si varios elementos son verdaderos

*** =&&= verifica si dos condiciones son verdaderas
El operador =&&= retorna verdadero, solo si *ambas* condiciones dadas son verdaderas.

#+begin_src c
if ((dealer_up_card == 6) && (hand == 11))
    double_down();
#+end_src

Si la primera condición es verdadera, entonces se evalúa la segunda. Si este no fuera el caso,
la computadora no evalúa la segunda.

*** =||= Evalúa si una de las condiciones es verdadera
El operador =or= (=||=) retorna verdadero si *cualquiera* de las condiciones dadas es verdadera.

#+begin_src c
if (cupcakes_in_fridge || chips_on_table)
    eat_food();
#+end_src

*** =!=  Invierte el resultado de la condición
=!=  es el operador =not=, este invierte el resultado de una condición.

#+begin_src c
if (!brad_on_phone)
    answer_phone();
#+end_src

*** booleanos
En C los valores booleanos son representados con números, Para C el número 0 es falso y cualquier
número que no sea 0 es tratado como verdadero.

Así que código como el siguiente funciona.

#+begin_src c
int people_moshing = 35;
if (people_moshing)
    take_off_glases();
#+end_src

En C también podemos usar =|= y =&= en lugar de =||= y =&&=, pero estos *siempre* evalúan ambas condiciones, mientras que
los otros puede saltarse evaluar la segunda condición.

Los operadores =| y &= existen porque hacen operaciones de bit a bit en los bits individuales de un número
por ejemplo:

=6 & 4= es igual a 4 ya que si verificamos que bits binarios tienen en común 6 (110 en binario) y 4 (100 en binario) obtenemos (100).

