Publ/Libros/HeadFirstC/HeadFirstC.html

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Painless Operations</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
En C, el símbolo de igual (=) es usado para asignaciones. pero un doble igual es usado para verificar igualdad.
Pero tambien lo podemos usar para hacer operaciones
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffc9e8;">teeth</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">4</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// asignaci&#243;n</span>
teeth <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">4</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// igualdad</span>
<span style="color: #ffc9e8;">teeth</span> <span style="color: #ff79c6; font-style: italic;">+=</span> <span style="color: #8be9fd;">2</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Sumar dos a teeth</span>
teeth <span style="color: #ff79c6; font-style: italic;">-+</span> <span style="color: #8be9fd;">2</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Sestar dos a teeth</span>
<span style="color: #ffc9e8;">theeth</span> <span style="color: #ff79c6; font-style: italic;">++</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Incrementar teeth 1</span>
<span style="color: #ffc9e8;">theeth</span> <span style="color: #ff79c6; font-style: italic;">--</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Decrementar teeth 1</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Dos tipos de comandos</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Hasta ahora cada comando que se ha visto cae en una de dos categorías:
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Haz algo</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
La mayoría de los comandos en C son expresiones. Estos <b>hacen</b> cosas y nos <b>dicen</b> cosas.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #bd93f9; font-weight: bold;">split_hand</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// &lt;- expresi&#243;n simple</span>
</pre>
</div>

<p>
A veces agrupamos expresiones juntas para crear un <b>bloque</b> y estos están entre llaves.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">deal_first_card</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">deal_second_card</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ffc9e8;">cards_in_hand</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">2</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Haz algo <b>solo si</b> algo más es verdadero</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Expresiones de control como el <code>if</code> verifican una condición antes de correr el código.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span>value_of_hand <span style="color: #ff79c6; font-style: italic;">&lt;=</span> <span style="color: #8be9fd;">16</span><span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #6272a4; font-style: italic;">// Condici&#243;n</span>
    <span style="color: #bd93f9; font-weight: bold;">hit</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Esta expresi&#243;n correr&#225; si la condici&#243;n es verdadera.</span>
<span style="color: #ff79c6; font-style: italic;">else</span>
    <span style="color: #bd93f9; font-weight: bold;">stand</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Corre esta expresi&#243;n si la condici&#243;n es falsa.</span>
</pre>
</div>

<p>
Si una expresión <code>if</code> necesita hacer más de una cosa, podemos agregar las llaves para hacer un bloque
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span>dealer_card <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">5</span><span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">double_down</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">hit</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> There&rsquo;s more to booleans than equals</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Hay ocasiones en las cuales queremos ver si varios elementos son verdaderos
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> <code>&amp;&amp;</code> verifica si dos condiciones son verdaderas</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
El operador <code>&amp;&amp;</code> retorna verdadero, solo si <b>ambas</b> condiciones dadas son verdaderas.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ff79c6; background-color: #282a36;">(</span>dealer_up_card <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">6</span><span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; font-style: italic;">&amp;&amp;</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>hand <span style="color: #ff79c6; font-style: italic;">==</span> <span style="color: #8be9fd;">11</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #61bfff; background-color: #282a36;">)</span>
    <span style="color: #bd93f9; font-weight: bold;">double_down</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<p>
Si la primera condición es verdadera, entonces se evalúa la segunda. Si este no fuera el caso,
la computadora no evalúa la segunda.
</p>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> <code>||</code> Evalúa si una de las condiciones es verdadera</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
El operador <code>or</code> (<code>||</code>) retorna verdadero si <b>cualquiera</b> de las condiciones dadas es verdadera.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span>cupcakes_in_fridge <span style="color: #ff79c6; font-style: italic;">||</span> chips_on_table<span style="color: #61bfff; background-color: #282a36;">)</span>
    <span style="color: #bd93f9; font-weight: bold;">eat_food</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> <code>!</code>  Invierte el resultado de la condición</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
<code>!</code>  es el operador <code>not</code>, este invierte el resultado de una condición.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ff79c6; font-style: italic;">!</span>brad_on_phone<span style="color: #61bfff; background-color: #282a36;">)</span>
    <span style="color: #bd93f9; font-weight: bold;">answer_phone</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> booleanos</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
En C los valores booleanos son representados con números, Para C el número 0 es falso y cualquier
número que no sea 0 es tratado como verdadero.
</p>

<p>
Así que código como el siguiente funciona.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">people_moshing</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">35</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff; background-color: #282a36;">(</span>people_moshing<span style="color: #61bfff; background-color: #282a36;">)</span>
    <span style="color: #bd93f9; font-weight: bold;">take_off_glases</span><span style="color: #61bfff; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<p>
En C también podemos usar <code>|</code> y <code>&amp;</code> en lugar de <code>||</code> y <code>&amp;&amp;</code>, pero estos <b>siempre</b> evalúan ambas condiciones, mientras que
los otros puede saltarse evaluar la segunda condición.
</p>

<p>
Los operadores <code>| y &amp;</code> existen porque hacen operaciones de bit a bit en los bits individuales de un número
por ejemplo:
</p>

<p>
<code>6 &amp; 4</code> es igual a 4 ya que si verificamos que bits binarios tienen en común 6 (110 en binario) y 4 (100 en binario) obtenemos (100).
</p>
</div>
</div>
</div>
