Files/Libros/HeadFirstC/HeadFirstC.org
** Pulling the ol' switcheroo
A veces cuando escribimos lógica condicional, necesitamos verificar el valor de la misma variable
más de una vez, para evitar tener muchos =if= tenemos el =switch=

#+begin_src c
switch (train) {
    case 37:
        winnings = winnings + 50;
        break;
    case 65:
        winnings = winnings + 80;
        break;
    case 12:
        winnings = winnings + 20;
        break;
    default:
        winnings = 0;
}
#+end_src

Cuando la computadora llega a un =switch= verifica el valor que se le dio y busca un caso que se sea igual.
Cuando lo encuentra, corre *todo* el código que sigue partir de allí en adelante hasta que se encuentre un =break=

No debemos olvidar poner =breaks= cuando los necesitamos porque nuestro código podría no funcionar como queremos.

** Sometimes once is not enough
*** Usando ciclos =while= en C
Ciclos son un tipo especial de sentencias de control. Un ciclo decide cuantas veces una pieza de código
será ejecutada.

El ciclo más básico de C es el ciclo =while=. Este ejecuta código una vez tras otra mientras una condición
sea verdadera.

#+begin_src c
while (<some condition>) { // <- Verifica la condición antes de correr el bloque
    // Haz algo aqui // <- Si hay una sola linea en el cuerpo no necesitas las llaves.
} // <- Cuando la computadora llega al final del bloque vuelve a verificar si la condicón es verdadera.
#+end_src

*** =do while=
Hay una variación de el ciclo =while= que verifica la condición del loop después de ejecutar el codigo.

Por lo tanto el código es ejecutado al menos una vez.

#+begin_src c
do {
    // Algo
} while (have_not_won);
#+end_src

** Los ciclos a veces siguen la misma estructura
- Hacer algo simple antes del ciclo, como poner un contador
- Tener una condición simple en el ciclo.
- Hacer algo al final del ciclo, como actualizar un contador.

#+begin_src c
int counter = 1;
while (counter < 11) {
    printf("%i green bottles, hanging on a wall\n", counter);
    counter++;
}
#+end_src

*** El ciclo =for=
Los diseñadores de c crearon el ciclo =for= para hacer esta estructura más consisa.

Este es el mismo ejemplo de arriba con un ciclo =for=

#+begin_src c
int counter;
for (counter = 1; counter < 11; counter++){
    printf("%i green bottles, hanging on a wall\n", counter);
}
#+end_src

En el ciclo =for= inicializamos la variable del ciclo (=counter=1=).
Damos una condición que debe de ser verificada (=counter < 11=)
en cada iteración y tenemos un código que va a ser ejecutado al final (=counter++=).

** Usas un =break= para salir
Puedes crear ciclos que verifican una condición al inicio o al final de un bloque de código.
Pero también podemos salir del ciclo con la palabra =break=.

#+begin_src c
while (feeling_hungry) {
    eat_cake();
    if (fealing_queasy) {
        // Salimos del ciclo
        break; // El break te saca del ciclo inmediatamente
    }
    drink_coffee();
}
#+end_src

Los =breaks= te sacan del ciclo saltándose todo el código que siga dentro del bloque del ciclo.

