Publ/Libros/HeadFirstC/HeadFirstC.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Pulling the ol&rsquo; switcheroo</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A veces cuando escribimos lógica condicional, necesitamos verificar el valor de la misma variable
más de una vez, para evitar tener muchos <code>if</code> tenemos el <code>switch</code>
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">switch</span> <span style="color: #61bfff; background-color: #282a36;">(</span>train<span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">37</span>:
        <span style="color: #ffc9e8;">winnings</span> <span style="color: #ff79c6; font-style: italic;">=</span> winnings <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">50</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
        <span style="color: #ff79c6; font-style: italic;">break</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">65</span>:
        <span style="color: #ffc9e8;">winnings</span> <span style="color: #ff79c6; font-style: italic;">=</span> winnings <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">80</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
        <span style="color: #ff79c6; font-style: italic;">break</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">case</span> <span style="color: #8be9fd;">12</span>:
        <span style="color: #ffc9e8;">winnings</span> <span style="color: #ff79c6; font-style: italic;">=</span> winnings <span style="color: #ff79c6; font-style: italic;">+</span> <span style="color: #8be9fd;">20</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
        <span style="color: #ff79c6; font-style: italic;">break</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">default</span>:
        <span style="color: #ffc9e8;">winnings</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">0</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>

<p>
Cuando la computadora llega a un <code>switch</code> verifica el valor que se le dio y busca un caso que se sea igual.
Cuando lo encuentra, corre <b>todo</b> el código que sigue partir de allí en adelante hasta que se encuentre un <code>break</code>
</p>

<p>
No debemos olvidar poner <code>breaks</code> cuando los necesitamos porque nuestro código podría no funcionar como queremos.
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Sometimes once is not enough</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Usando ciclos <code>while</code> en C</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Ciclos son un tipo especial de sentencias de control. Un ciclo decide cuantas veces una pieza de código
será ejecutada.
</p>

<p>
El ciclo más básico de C es el ciclo <code>while</code>. Este ejecuta código una vez tras otra mientras una condición
sea verdadera.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ff79c6; font-style: italic;">&lt;</span>some condition<span style="color: #ff79c6; font-style: italic;">&gt;</span><span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span> <span style="color: #6272a4; font-style: italic;">// &lt;- Verifica la condici&#243;n antes de correr el bloque</span>
    <span style="color: #6272a4; font-style: italic;">// Haz algo aqui // &lt;- Si hay una sola linea en el cuerpo no necesitas las llaves.</span>
<span style="color: #61bfff; background-color: #282a36;">}</span> <span style="color: #6272a4; font-style: italic;">// &lt;- Cuando la computadora llega al final del bloque vuelve a verificar si la condic&#243;n es verdadera.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> <code>do while</code></h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Hay una variación de el ciclo <code>while</code> que verifica la condición del loop después de ejecutar el codigo.
</p>

<p>
Por lo tanto el código es ejecutado al menos una vez.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">do</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #6272a4; font-style: italic;">// Algo</span>
<span style="color: #61bfff; background-color: #282a36;">}</span> <span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #61bfff; background-color: #282a36;">(</span>have_not_won<span style="color: #61bfff; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Los ciclos a veces siguen la misma estructura</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Hacer algo simple antes del ciclo, como poner un contador
</li>
<li>Tener una condición simple en el ciclo.
</li>
<li>Hacer algo al final del ciclo, como actualizar un contador.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">counter</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">1</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #61bfff; background-color: #282a36;">(</span>counter <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">11</span><span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%i green bottles, hanging on a wall\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> counter<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ffc9e8;">counter</span><span style="color: #ff79c6; font-style: italic;">++</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>

<div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> El ciclo <code>for</code></h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
Los diseñadores de c crearon el ciclo <code>for</code> para hacer esta estructura más consisa.
</p>

<p>
Este es el mismo ejemplo de arriba con un ciclo <code>for</code>
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">counter</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ffc9e8;">counter</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">1</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> counter <span style="color: #ff79c6; font-style: italic;">&lt;</span> <span style="color: #8be9fd;">11</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #ffc9e8;">counter</span><span style="color: #ff79c6; font-style: italic;">++</span><span style="color: #61bfff; background-color: #282a36;">){</span>
    <span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%i green bottles, hanging on a wall\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> counter<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>

<p>
En el ciclo <code>for</code> inicializamos la variable del ciclo (<code>counter=1</code>).
Damos una condición que debe de ser verificada (<code>counter &lt; 11</code>)
en cada iteración y tenemos un código que va a ser ejecutado al final (<code>counter++</code>).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Usas un <code>break</code> para salir</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Puedes crear ciclos que verifican una condición al inicio o al final de un bloque de código.
Pero también podemos salir del ciclo con la palabra <code>break</code>.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #61bfff; background-color: #282a36;">(</span>feeling_hungry<span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">eat_cake</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>fealing_queasy<span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #6272a4; font-style: italic;">// Salimos del ciclo</span>
        <span style="color: #ff79c6; font-style: italic;">break</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// El break te saca del ciclo inmediatamente</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span>
    <span style="color: #bd93f9; font-weight: bold;">drink_coffee</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>

<p>
Los <code>breaks</code> te sacan del ciclo saltándose todo el código que siga dentro del bloque del ciclo.
</p>
</div>
