Files/Libros/HeadFirstC/HeadFirstC.org
*** Usamos =continue= para continuar
Si queremos saltarnos todo el código que sigue en el bloque e ir a la siguiente iteración.

#+begin_src c
while (feeling_hungry) {
    eat_cake();
    if (fealing_queasy) {
        // Salimos del ciclo
        continue; // lo usuamos para regresar al inicio del bloque de código
    }
    drink_coffee();
}
#+end_src

** Escribiendo funciones
Casi todas las funciones en C siguen el mismo formato, por ejemplo

#+begin_src c
#include <stdio.h>

int larger (int a, int b) { // <- Recibe dos argumentos a y b
    if (a > b)
        return a;
    return b;
    }

int main () {
    int greatest = larger(100, 1000);
    printf("%i is the largest!\n", greatest);
    return 0;
    }
#+end_src

- La función =larger= es diferente a =main= porque recibe dos argumentos.
  - Un argumento es una variable local (solo pertenece ese bloque de código) que obtiene su valor de cuando se llama.
  - La función =larger= toma como argumentos a y b que son enteros y estos deben de ser dados siempre.

*** Funciones =void=
A veces necesitamos crear funciones que no tienen nada útil que retornar, para esto esta el tipo =void=.
Con este nuestras funciones no tienen que tener un =return=.

#+begin_src c
void complain() {
    puts("I'm really not happy"); // :c
}
#+end_src

En C la palabra =void= significa "no importa", cuando tu le digas al compilador que no te importa retornar un valor
en tu función, no necesitaras un =return=.

*** Encadenando sentencias
Casi todo en C tiene un valor de retorno, no solo llamadas a funciones. De hecho cosas como asignaciones tienen valores
de retorno. Por ejemplo

#+begin_src c
x = 4;
#+end_src

Asigna el número 4 a una variable. la parte interesante es que la expresión =x = 4= en *si misma* tiene el valor que será asignado
4.

Esto es importante porque significa que puedes encadenar asignaciones.

#+begin_src c
y = (x = 4); // Ahora y es 4 también.
y = x = 4; // lo mismo que arriba.
#+end_src

Se usan sentencias encadenadas para asignar variables que tienen el mismo valor.

* What are you pointing at?
El lenguaje C te da mucho más control sobre como tu programa usa la memoria de la computadora de lo normal, es necesario
saber como C maneja la memoria.
** El código en C incluye Punteros
Un *puntero* es solo la dirección de una pieza de información en la memoria.

Los punteros son usados por unas cuantas razones:
1. En lugar de pasar un copia de los datos, solo pasas el puntero de donde esta la información en memoria.
2. Podríamos querer que dos trozos de código trabajen con la misma pieza de información en lugar de con una copia.

** Escarbando en la memoria.
Cada vez que se declara una variable, la computadora crea espacio en algún lugar de la memoria para estos datos.

Si declaras una variable dentro de la función =main= la computadora la guardará en una sección de la memoria llamada
la pila (=stack=).

Si una variable es declarada afuera de *cualquier* función será guardada en la sección global (=globals=) de la memoria.

La computadora podría asignar la dirección de memoria de 4,100,000 en la pila para la variable x, si en la variable x
guardamos un 4 este se va a guardar en la misma dirección de memoria.

Podemos saber la dirección de memoria de una variable con el operador =&=.

#+begin_src c
printf("x is stored at %p\n", &n); // &p es usado para dar formato a direcciones.
#+end_src


Dandonos algo como esto.

#+begin_example
x is stored at 0x3E8FA0
#+end_example

=0x3E8FA0= es 4,100,000 en formato hexadecimal (base 16).

Esta seria la dirección de memoria en donde se guarda nuestra variable, se le llaman punteros porque apuntan a la variable
en memoria.


** Usando punteros de memoria
Hay 3 cosas que debes de saber para usar punteros para leer y escribir datos.
