Publ/Libros/HeadFirstC/HeadFirstC.html

<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> Usamos <code>continue</code> para continuar</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
Si queremos saltarnos todo el código que sigue en el bloque e ir a la siguiente iteración.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #61bfff; background-color: #282a36;">(</span>feeling_hungry<span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">eat_cake</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>fealing_queasy<span style="color: #ff79c6; background-color: #282a36;">)</span> <span style="color: #ff79c6; background-color: #282a36;">{</span>
        <span style="color: #6272a4; font-style: italic;">// Salimos del ciclo</span>
        <span style="color: #ff79c6; font-style: italic;">continue</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// lo usuamos para regresar al inicio del bloque de c&#243;digo</span>
    <span style="color: #ff79c6; background-color: #282a36;">}</span>
    <span style="color: #bd93f9; font-weight: bold;">drink_coffee</span><span style="color: #ff79c6; background-color: #282a36;">()</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Escribiendo funciones</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Casi todas las funciones en C siguen el mismo formato, por ejemplo
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #bd93f9; font-weight: bold;">#include</span> <span style="color: #f1fa8c;">&lt;stdio.h&gt;</span>

<span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">larger</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">a</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">b</span><span style="color: #61bfff; background-color: #282a36;">)</span> <span style="color: #61bfff; background-color: #282a36;">{</span> <span style="color: #6272a4; font-style: italic;">// &lt;- Recibe dos argumentos a y b</span>
    <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #ff79c6; background-color: #282a36;">(</span>a <span style="color: #ff79c6; font-style: italic;">&gt;</span> b<span style="color: #ff79c6; background-color: #282a36;">)</span>
        <span style="color: #ff79c6; font-style: italic;">return</span> a<span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">return</span> b<span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #61bfff; background-color: #282a36;">}</span>

<span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">main</span> <span style="color: #61bfff; background-color: #282a36;">()</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">greatest</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #bd93f9; font-weight: bold;">larger</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #8be9fd;">100</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #8be9fd;">1000</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"%i is the largest!\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> greatest<span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #8be9fd;">0</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
    <span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>La función <code>larger</code> es diferente a <code>main</code> porque recibe dos argumentos.
<ul class="org-ul">
<li>Un argumento es una variable local (solo pertenece ese bloque de código) que obtiene su valor de cuando se llama.
</li>
<li>La función <code>larger</code> toma como argumentos a y b que son enteros y estos deben de ser dados siempre.
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> Funciones <code>void</code></h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
A veces necesitamos crear funciones que no tienen nada útil que retornar, para esto esta el tipo <code>void</code>.
Con este nuestras funciones no tienen que tener un <code>return</code>.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">complain</span><span style="color: #61bfff; background-color: #282a36;">()</span> <span style="color: #61bfff; background-color: #282a36;">{</span>
    <span style="color: #bd93f9; font-weight: bold;">puts</span><span style="color: #ff79c6; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"I'm really not happy"</span><span style="color: #ff79c6; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// :c</span>
<span style="color: #61bfff; background-color: #282a36;">}</span>
</pre>
</div>

<p>
En C la palabra <code>void</code> significa &ldquo;no importa&rdquo;, cuando tu le digas al compilador que no te importa retornar un valor
en tu función, no necesitaras un <code>return</code>.
</p>
</div>
</div>

<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> Encadenando sentencias</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
Casi todo en C tiene un valor de retorno, no solo llamadas a funciones. De hecho cosas como asignaciones tienen valores
de retorno. Por ejemplo
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">4</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<p>
Asigna el número 4 a una variable. la parte interesante es que la expresión <code>x = 4</code> en <b>si misma</b> tiene el valor que será asignado
</p>
<ol class="org-ol">
<li></li>
</ol>

<p>
Esto es importante porque significa que puedes encadenar asignaciones.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffc9e8;">y</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">4</span><span style="color: #61bfff; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// Ahora y es 4 tambi&#233;n.</span>
<span style="color: #ffc9e8;">y</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">4</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// lo mismo que arriba.</span>
</pre>
</div>

<p>
Se usan sentencias encadenadas para asignar variables que tienen el mismo valor.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What are you pointing at?</h2>
<div class="outline-text-2" id="text-2">
<p>
El lenguaje C te da mucho más control sobre como tu programa usa la memoria de la computadora de lo normal, es necesario
saber como C maneja la memoria.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> El código en C incluye Punteros</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Un <b>puntero</b> es solo la dirección de una pieza de información en la memoria.
</p>

<p>
Los punteros son usados por unas cuantas razones:
</p>
<ol class="org-ol">
<li>En lugar de pasar un copia de los datos, solo pasas el puntero de donde esta la información en memoria.
</li>
<li>Podríamos querer que dos trozos de código trabajen con la misma pieza de información en lugar de con una copia.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Escarbando en la memoria.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Cada vez que se declara una variable, la computadora crea espacio en algún lugar de la memoria para estos datos.
</p>

<p>
Si declaras una variable dentro de la función <code>main</code> la computadora la guardará en una sección de la memoria llamada
la pila (<code>stack</code>).
</p>

<p>
Si una variable es declarada afuera de <b>cualquier</b> función será guardada en la sección global (<code>globals</code>) de la memoria.
</p>

<p>
La computadora podría asignar la dirección de memoria de 4,100,000 en la pila para la variable x, si en la variable x
guardamos un 4 este se va a guardar en la misma dirección de memoria.
</p>

<p>
Podemos saber la dirección de memoria de una variable con el operador <code>&amp;</code>.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"x is stored at %p\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #ff79c6; font-style: italic;">&amp;</span>n<span style="color: #61bfff; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span> <span style="color: #6272a4; font-style: italic;">// &amp;p es usado para dar formato a direcciones.</span>
</pre>
</div>


<p>
Dandonos algo como esto.
</p>

<pre class="example">
x is stored at 0x3E8FA0
</pre>

<p>
<code>0x3E8FA0</code> es 4,100,000 en formato hexadecimal (base 16).
</p>

<p>
Esta seria la dirección de memoria en donde se guarda nuestra variable, se le llaman punteros porque apuntan a la variable
en memoria.
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Usando punteros de memoria</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Hay 3 cosas que debes de saber para usar punteros para leer y escribir datos.
</p>
</div>
