Files/Libros/HeadFirstC/HeadFirstC.org
*** Obtener la dirección de memoria
Podemos obtener la dirección de memoria de una variable con el operador =&=.

#+begin_src c
int x = 4;
printf("x lives at %p\n", &x);
#+end_src

Pero ya que podemos acceder a la dirección de memoria debemos guardarla en algún lado,
para eso necesitamos una *variable puntero*.

Una variable puntero es una variable que guarda una dirección de memoria.

Cuando declaramos una variable puntero, debemos decir de que tipo de dato esta guardado en esa dirección de memoria.

#+begin_src c
int *addres_of_x;
#+end_src

*** Leer los contenidos de la variable
Cuando ya tienes la dirección de memoria guardada, querrás leer la información que esta allí, lo haces con el operador =*=.

#+begin_src c
int value_stored = *addres_of_x;
#+end_src

El operador =*= y =&= son opuestos.

El operador =&= toma un pedazo de datos y te dice donde están guardados. Y el operador =*= toma una dirección y te dice
que esta guardado allí.

Los punteros a veces son llamados /referencias/, el operador =*= se dice que deferencia una asignación.

*** Cambiar el contenido de una dirección
Si tienes una variable puntero y quieres cambiar la información de la dirección podemos usar el operador =*= de nuevo.

#+begin_src c
*addres_of_x = 99;
#+end_src
