Publ/Libros/HeadFirstC/HeadFirstC.html
<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Obtener la dirección de memoria</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Podemos obtener la dirección de memoria de una variable con el operador <code>&amp;</code>.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">x</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">4</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
<span style="color: #bd93f9; font-weight: bold;">printf</span><span style="color: #61bfff; background-color: #282a36;">(</span><span style="color: #f1fa8c;">"x lives at %p\n"</span><span style="color: #f8f8f2; background-color: #282a36;">,</span> <span style="color: #ff79c6; font-style: italic;">&amp;</span>x<span style="color: #61bfff; background-color: #282a36;">)</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<p>
Pero ya que podemos acceder a la dirección de memoria debemos guardarla en algún lado,
para eso necesitamos una <b>variable puntero</b>.
</p>

<p>
Una variable puntero es una variable que guarda una dirección de memoria.
</p>

<p>
Cuando declaramos una variable puntero, debemos decir de que tipo de dato esta guardado en esa dirección de memoria.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ff79c6; font-style: italic;">*</span><span style="color: #ffc9e8;">addres_of_x</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Leer los contenidos de la variable</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Cuando ya tienes la dirección de memoria guardada, querrás leer la información que esta allí, lo haces con el operador <code>*</code>.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ffb86c;">int</span> <span style="color: #ffc9e8;">value_stored</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #ff79c6; font-style: italic;">*</span>addres_of_x<span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>

<p>
El operador <code>*</code> y <code>&amp;</code> son opuestos.
</p>

<p>
El operador <code>&amp;</code> toma un pedazo de datos y te dice donde están guardados. Y el operador <code>*</code> toma una dirección y te dice
que esta guardado allí.
</p>

<p>
Los punteros a veces son llamados <i>referencias</i>, el operador <code>*</code> se dice que deferencia una asignación.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> Cambiar el contenido de una dirección</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Si tienes una variable puntero y quieres cambiar la información de la dirección podemos usar el operador <code>*</code> de nuevo.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff79c6; font-style: italic;">*</span><span style="color: #ffc9e8;">addres_of_x</span> <span style="color: #ff79c6; font-style: italic;">=</span> <span style="color: #8be9fd;">99</span><span style="color: #f8f8f2; background-color: #282a36;">;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-02-25 Fri 01:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
